name: "TinyVOC"
layer {
  name: "data"
  type: "AnnotatedData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    scale: 0.003921
    force_color: true
    resize_param {
      prob: 0.1
      resize_mode: WARP
      height: 320
      width: 320
      interp_mode: LINEAR
      interp_mode: AREA
      interp_mode: LANCZOS4
    }
    resize_param {
      prob: 0.1
      resize_mode: WARP
      height: 352
      width: 352
      interp_mode: LINEAR
      interp_mode: AREA
      interp_mode: LANCZOS4
    }
    resize_param {
      prob: 0.1
      resize_mode: WARP
      height: 384
      width: 384
      interp_mode: LINEAR
      interp_mode: AREA
      interp_mode: LANCZOS4
    }
    resize_param {
      prob: 0.1
      resize_mode: WARP
      height: 416
      width: 416
      interp_mode: LINEAR
      interp_mode: AREA
      interp_mode: LANCZOS4
    }
    resize_param {
      prob: 0.1
      resize_mode: WARP
      height: 448
      width: 448
      interp_mode: LINEAR
      interp_mode: AREA
      interp_mode: LANCZOS4
    }
    resize_param {
      prob: 0.1
      resize_mode: WARP
      height: 480
      width: 480
      interp_mode: LINEAR
      interp_mode: AREA
      interp_mode: LANCZOS4
    }
    resize_param {
      prob: 0.1
      resize_mode: WARP
      height: 512
      width: 512
      interp_mode: LINEAR
      interp_mode: AREA
      interp_mode: LANCZOS4
    }
    resize_param {
      prob: 0.1
      resize_mode: WARP
      height: 544
      width: 544
      interp_mode: LINEAR
      interp_mode: AREA
      interp_mode: LANCZOS4
    }
    resize_param {
      prob: 0.1
      resize_mode: WARP
      height: 576
      width: 576
      interp_mode: LINEAR
      interp_mode: AREA
      interp_mode: LANCZOS4
    }
    resize_param {
      prob: 0.1
      resize_mode: WARP
      height: 608
      width: 608
      interp_mode: LINEAR
      interp_mode: AREA
      interp_mode: LANCZOS4
    }
    emit_constraint {
      emit_type: CENTER
    }
    distort_param {
      brightness_prob: 0.5
      brightness_delta: 32.0
      contrast_prob: 0.5
      contrast_lower: 0.5
      contrast_upper: 1.5
      hue_prob: 0.5
      hue_delta: 18.0
      saturation_prob: 0.5
      saturation_lower: 0.5
      saturation_upper: 1.5
      random_order_prob: 0.5
    }
    noise_param {
      hist_eq: true
      hist_eq_prob: 0.5
      inverse: false
      decolorize: false
      gauss_blur: true
      gauss_blur_prob: 0.15
      posterize: false
      saltpepper: true
      saltpepper_prob: 0.25
      saltpepper_param {
        fraction: 0.01
      }
      convert_to_hsv: false
    }
  }
  data_param {
    source: "data/VOC0712/VOC0712_trainval_lmdb"
    batch_size: 8
    prefetch: 8
    backend: LMDB
  }
  annotated_data_param {
    yolo_data_type: true
    yolo_data_jitter: 0.3
    label_map_file: "data/VOC0712/labelmap_voc.prototxt"
  }
}
layer {
  name: "data"
  type: "AnnotatedData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: true
    scale: 0.003921
    force_color: true
    resize_param {
      prob: 1.0
      resize_mode: WARP
      height: 416
      width: 416
      interp_mode: LINEAR
    }
  }
  data_param {
    source: "data/VOC0712/VOC0712_test_lmdb"
    batch_size: 1
    backend: LMDB
  }
  annotated_data_param {
    batch_sampler {}
    yolo_data_type: false
    label_map_file:  "data/VOC0712/labelmap_voc.prototxt"
  }
}

layer {
  name: "block0-conv0"
  type: "Convolution"
  bottom: "data"
  top: "block0-conv0"
  convolution_param {
    num_output: 16
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    pad: 1
    stride: 1
    bias_term: false
    engine: DEFAULT
  }
}
layer {
  name: "block0-bn0"
  type: "BatchNorm"
  bottom: "block0-conv0"
  top: "block0-conv0"
  batch_norm_param {
    moving_average_fraction: 0.1
  }
}
layer {
  name: "block0-scale0"
  type: "Scale"
  bottom: "block0-conv0"
  top: "block0-conv0"
  scale_param {
    bias_term: true
    filler {
      value: 1.0
    }
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "block0-relu0"
  type: "ReLU"
  bottom: "block0-conv0"
  top: "block0-conv0"
  relu_param {
    negative_slope: 0.1
  }
}
layer {
  name: "block0-pool"
  type: "Pooling"
  bottom: "block0-conv0"
  top: "block0-pool"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
    pad: 0
    engine: DEFAULT
  }
}
layer {
  name: "block1-conv0"
  type: "Convolution"
  bottom: "block0-pool"
  top: "block1-conv0"
  convolution_param {
    num_output: 32
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    pad: 1
    stride: 1
    bias_term: false
    engine: DEFAULT
  }
}
layer {
  name: "block1-bn0"
  type: "BatchNorm"
  bottom: "block1-conv0"
  top: "block1-conv0"
  batch_norm_param {
    moving_average_fraction: 0.1
  }
}
layer {
  name: "block1-scale0"
  type: "Scale"
  bottom: "block1-conv0"
  top: "block1-conv0"
  scale_param {
    bias_term: true
    filler {
      value: 1.0
    }
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "block1-relu0"
  type: "ReLU"
  bottom: "block1-conv0"
  top: "block1-conv0"
  relu_param {
    negative_slope: 0.1
  }
}
layer {
  name: "block1-pool"
  type: "Pooling"
  bottom: "block1-conv0"
  top: "block1-pool"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
    pad: 0
    engine: DEFAULT
  }
}
layer {
  name: "block2-conv0"
  type: "Convolution"
  bottom: "block1-pool"
  top: "block2-conv0"
  convolution_param {
    num_output: 64
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    pad: 1
    stride: 1
    bias_term: false
  }
}
layer {
  name: "block2-bn0"
  type: "BatchNorm"
  bottom: "block2-conv0"
  top: "block2-conv0"
  batch_norm_param {
    moving_average_fraction: 0.1
  }
}
layer {
  name: "block2-scale0"
  type: "Scale"
  bottom: "block2-conv0"
  top: "block2-conv0"
  scale_param {
    bias_term: true
    filler {
      value: 1.0
    }
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "block2-relu0"
  type: "ReLU"
  bottom: "block2-conv0"
  top: "block2-conv0"
  relu_param {
    negative_slope: 0.1
  }
}
layer {
  name: "block2-pool"
  type: "Pooling"
  bottom: "block2-conv0"
  top: "block2-pool"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
    pad: 0
    engine: DEFAULT
  }
}
layer {
  name: "block3-conv0"
  type: "Convolution"
  bottom: "block2-pool"
  top: "block3-conv0"
  convolution_param {
    num_output: 128
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    pad: 1
    stride: 1
    bias_term: false
    engine: DEFAULT
  }
}
layer {
  name: "block3-bn0"
  type: "BatchNorm"
  bottom: "block3-conv0"
  top: "block3-conv0"
  batch_norm_param {
    moving_average_fraction: 0.1
  }
}
layer {
  name: "block3-scale0"
  type: "Scale"
  bottom: "block3-conv0"
  top: "block3-conv0"
  scale_param {
    bias_term: true
    filler {
      value: 1.0
    }
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "block3-relu0"
  type: "ReLU"
  bottom: "block3-conv0"
  top: "block3-conv0"
  relu_param {
    negative_slope: 0.1
  }
}

layer {
  name: "block3-pool"
  type: "Pooling"
  bottom: "block3-conv0"
  top: "block3-pool"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
    pad: 0
    engine: DEFAULT
  }
}
layer {
  name: "block4-conv0"
  type: "Convolution"
  bottom: "block3-pool"
  top: "block4-conv0"
  convolution_param {
    num_output: 256
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    pad: 1
    stride: 1
    bias_term: false
    engine: DEFAULT
  }
}
layer {
  name: "block4-bn0"
  type: "BatchNorm"
  bottom: "block4-conv0"
  top: "block4-conv0"
  batch_norm_param {
    moving_average_fraction: 0.1
  }
}
layer {
  name: "block4-scale0"
  type: "Scale"
  bottom: "block4-conv0"
  top: "block4-conv0"
  scale_param {
    bias_term: true
    filler {
      value: 1.0
    }
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "block4-relu0"
  type: "ReLU"
  bottom: "block4-conv0"
  top: "block4-conv0"
  relu_param {
    negative_slope: 0.1
  }
}

# mask0
###############################################################################################
# branch 0

# branch 1
layer {
  name: "mask0/bottle1/conv0"
  type: "Convolution"
  bottom: "block4-conv0"
  top: "mask0/bottle1/conv0"
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    stride: 2
    pad: 0
    bias_term: false
    group: 1
    dilation: 1
  }
}
layer {
  name: "mask0/bottle1/conv0/bn"
  type: "BatchNorm"
  bottom: "mask0/bottle1/conv0"
  top: "mask0/bottle1/conv0"
  batch_norm_param {
    moving_average_fraction: 0.1
  }
}
layer {
  name: "mask0/bottle1/conv0/scale"
  type: "Scale"
  bottom: "mask0/bottle1/conv0"
  top: "mask0/bottle1/conv0"
  scale_param {
    bias_term: true
    filler {
      value: 1.0
    }
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "mask0/bottle1/conv0/relu"
  type: "ReLU"
  bottom: "mask0/bottle1/conv0"
  top: "mask0/bottle1/conv0"
  relu_param {
    negative_slope: 0.1
  }
}
layer {
  name: "mask0/bottle1/conv1"
  type: "Convolution"
  bottom: "mask0/bottle1/conv0"
  top: "mask0/bottle1/conv1"
  convolution_param {
    num_output: 128
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    stride: 1
    pad: 1
    bias_term: false
    group: 1
    dilation: 1
  }
}
layer {
  name: "mask0/bottle1/conv1/bn"
  type: "BatchNorm"
  bottom: "mask0/bottle1/conv1"
  top: "mask0/bottle1/conv1"
  batch_norm_param {
    moving_average_fraction: 0.1
  }
}
layer {
  name: "mask0/bottle1/conv1/scale"
  type: "Scale"
  bottom: "mask0/bottle1/conv1"
  top: "mask0/bottle1/conv1"
  scale_param {
    bias_term: true
    filler {
      value: 1.0
    }
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "mask0/bottle1/conv1/relu"
  type: "ReLU"
  bottom: "mask0/bottle1/conv1"
  top: "mask0/bottle1/conv1"
  relu_param {
    negative_slope: 0.1
  }
}
layer {
  name: "mask0/bottle1/conv2"
  type: "Convolution"
  bottom: "mask0/bottle1/conv1"
  top: "mask0/bottle1/conv2"
  convolution_param {
    num_output: 512
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    stride: 1
    pad: 0
    bias_term: false
    group: 1
    dilation: 1
  }
}
layer {
  name: "mask0/bottle1/conv2/bn"
  type: "BatchNorm"
  bottom: "mask0/bottle1/conv2"
  top: "mask0/bottle1/conv2"
  batch_norm_param {
    moving_average_fraction: 0.1
  }
}
layer {
  name: "mask0/bottle1/conv2/scale"
  type: "Scale"
  bottom: "mask0/bottle1/conv2"
  top: "mask0/bottle1/conv2"
  scale_param {
    bias_term: true
    filler {
      value: 1.0
    }
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "mask0/bottle1/downsample"
  type: "Convolution"
  bottom: "block4-conv0"
  top: "mask0/bottle1/downsample"
  convolution_param {
    num_output: 512
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    stride: 2
    pad: 0
    bias_term: false
    group: 1
    dilation: 1
  }
}
layer {
  name: "mask0/bottle1/downsample/bn"
  type: "BatchNorm"
  bottom: "mask0/bottle1/downsample"
  top: "mask0/bottle1/downsample"
  batch_norm_param {
    moving_average_fraction: 0.1
  }
}
layer {
  name: "mask0/bottle1/downsample/scale"
  type: "Scale"
  bottom: "mask0/bottle1/downsample"
  top: "mask0/bottle1/downsample"
  scale_param {
    bias_term: true
    filler {
      value: 1.0
    }
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "mask0/bottle1/res"
  type: "Eltwise"
  bottom: "mask0/bottle1/downsample"
  bottom: "mask0/bottle1/conv2"
  top: "mask0/bottle1/res"
}
layer {
  name: "mask0/bottle1/res/relu"
  type: "ReLU"
  bottom: "mask0/bottle1/res"
  top: "mask0/bottle1/res"
  relu_param {
    negative_slope: 0.1
  }
}

layer {
  name: "mask0/bottle2/conv0"
  type: "Convolution"
  bottom: "mask0/bottle1/res"
  top: "mask0/bottle2/conv0"
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    stride: 1
    pad: 0
    bias_term: false
    group: 1
    dilation: 1
  }
}
layer {
  name: "mask0/bottle2/conv0/bn"
  type: "BatchNorm"
  bottom: "mask0/bottle2/conv0"
  top: "mask0/bottle2/conv0"
  batch_norm_param {
    moving_average_fraction: 0.1
  }
}
layer {
  name: "mask0/bottle2/conv0/scale"
  type: "Scale"
  bottom: "mask0/bottle2/conv0"
  top: "mask0/bottle2/conv0"
  scale_param {
    bias_term: true
    filler {
      value: 1.0
    }
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "mask0/bottle2/conv0/relu"
  type: "ReLU"
  bottom: "mask0/bottle2/conv0"
  top: "mask0/bottle2/conv0"
  relu_param {
    negative_slope: 0.1
  }
}
layer {
  name: "mask0/bottle2/conv1"
  type: "Convolution"
  bottom: "mask0/bottle2/conv0"
  top: "mask0/bottle2/conv1"
  convolution_param {
    num_output: 128
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    stride: 1
    pad: 1
    bias_term: false
    group: 1
    dilation: 1
  }
}
layer {
  name: "mask0/bottle2/conv1/bn"
  type: "BatchNorm"
  bottom: "mask0/bottle2/conv1"
  top: "mask0/bottle2/conv1"
  batch_norm_param {
    moving_average_fraction: 0.1
  }
}
layer {
  name: "mask0/bottle2/conv1/scale"
  type: "Scale"
  bottom: "mask0/bottle2/conv1"
  top: "mask0/bottle2/conv1"
  scale_param {
    bias_term: true
    filler {
      value: 1.0
    }
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "mask0/bottle2/conv1/relu"
  type: "ReLU"
  bottom: "mask0/bottle2/conv1"
  top: "mask0/bottle2/conv1"
  relu_param {
    negative_slope: 0.1
  }
}
layer {
  name: "mask0/bottle2/conv2"
  type: "Convolution"
  bottom: "mask0/bottle2/conv1"
  top: "mask0/bottle2/conv2"
  convolution_param {
    num_output: 512
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    stride: 1
    pad: 0
    bias_term: false
    group: 1
    dilation: 1
  }
}
layer {
  name: "mask0/bottle2/conv2/bn"
  type: "BatchNorm"
  bottom: "mask0/bottle2/conv2"
  top: "mask0/bottle2/conv2"
  batch_norm_param {
    moving_average_fraction: 0.1
  }
}
layer {
  name: "mask0/bottle2/conv2/scale"
  type: "Scale"
  bottom: "mask0/bottle2/conv2"
  top: "mask0/bottle2/conv2"
  scale_param {
    bias_term: true
    filler {
      value: 1.0
    }
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "mask0/bottle2/res"
  type: "Eltwise"
  bottom: "mask0/bottle1/res"
  bottom: "mask0/bottle2/conv2"
  top: "mask0/bottle2/res"
}
layer {
  name: "mask0/bottle2/res/relu"
  type: "ReLU"
  bottom: "mask0/bottle2/res"
  top: "mask0/bottle2/res"
  relu_param {
    negative_slope: 0.1
  }
}

layer {
  name: "mask0/upsampler0"
  type: "Deconvolution"
  bottom: "mask0/bottle2/res"
  top: "mask0/upsampler0"
  convolution_param {
    num_output: 256
    kernel_size: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    stride: 2
    pad: 0
    bias_term: false
    group: 1
    dilation: 1
  }
}
layer {
  name: "mask0/upsampler0/bn"
  type: "BatchNorm"
  bottom: "mask0/upsampler0"
  top: "mask0/upsampler0"
  batch_norm_param {
    moving_average_fraction: 0.1
  }
}
layer {
  name: "mask0/upsampler0/scale"
  type: "Scale"
  bottom: "mask0/upsampler0"
  top: "mask0/upsampler0"
  scale_param {
    bias_term: true
    filler {
      value: 1.0
    }
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "mask0/upsampler0/relu"
  type: "ReLU"
  bottom: "mask0/upsampler0"
  top: "mask0/upsampler0"
  relu_param {
    negative_slope: 0.1
  }
}

layer {
  name: "mask0/bottle3/conv0"
  type: "Convolution"
  bottom: "mask0/upsampler0"
  top: "mask0/bottle3/conv0"
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    stride: 1
    pad: 0
    bias_term: false
    group: 1
    dilation: 1
  }
}
layer {
  name: "mask0/bottle3/conv0/bn"
  type: "BatchNorm"
  bottom: "mask0/bottle3/conv0"
  top: "mask0/bottle3/conv0"
  batch_norm_param {
    moving_average_fraction: 0.1
  }
}
layer {
  name: "mask0/bottle3/conv0/scale"
  type: "Scale"
  bottom: "mask0/bottle3/conv0"
  top: "mask0/bottle3/conv0"
  scale_param {
    bias_term: true
    filler {
      value: 1.0
    }
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "mask0/bottle3/conv0/relu"
  type: "ReLU"
  bottom: "mask0/bottle3/conv0"
  top: "mask0/bottle3/conv0"
  relu_param {
    negative_slope: 0.1
  }
}
layer {
  name: "mask0/bottle3/conv1"
  type: "Convolution"
  bottom: "mask0/bottle3/conv0"
  top: "mask0/bottle3/conv1"
  convolution_param {
    num_output: 64
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    stride: 1
    pad: 1
    bias_term: false
    group: 1
    dilation: 1
  }
}
layer {
  name: "mask0/bottle3/conv1/bn"
  type: "BatchNorm"
  bottom: "mask0/bottle3/conv1"
  top: "mask0/bottle3/conv1"
  batch_norm_param {
    moving_average_fraction: 0.1
  }
}
layer {
  name: "mask0/bottle3/conv1/scale"
  type: "Scale"
  bottom: "mask0/bottle3/conv1"
  top: "mask0/bottle3/conv1"
  scale_param {
    bias_term: true
    filler {
      value: 1.0
    }
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "mask0/bottle3/conv1/relu"
  type: "ReLU"
  bottom: "mask0/bottle3/conv1"
  top: "mask0/bottle3/conv1"
  relu_param {
    negative_slope: 0.1
  }
}
layer {
  name: "mask0/bottle3/conv2"
  type: "Convolution"
  bottom: "mask0/bottle3/conv1"
  top: "mask0/bottle3/conv2"
  convolution_param {
    num_output: 256
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    stride: 1
    pad: 0
    bias_term: false
    group: 1
    dilation: 1
  }
}
layer {
  name: "mask0/bottle3/conv2/bn"
  type: "BatchNorm"
  bottom: "mask0/bottle3/conv2"
  top: "mask0/bottle3/conv2"
  batch_norm_param {
    moving_average_fraction: 0.1
  }
}
layer {
  name: "mask0/bottle3/conv2/scale"
  type: "Scale"
  bottom: "mask0/bottle3/conv2"
  top: "mask0/bottle3/conv2"
  scale_param {
    bias_term: true
    filler {
      value: 1.0
    }
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "mask0/bottle3/res"
  type: "Eltwise"
  bottom: "mask0/upsampler0"
  bottom: "mask0/bottle3/conv2"
  top: "mask0/bottle3/res"
}
layer {
  name: "mask0/bottle3/res/relu"
  type: "ReLU"
  bottom: "mask0/bottle3/res"
  top: "mask0/bottle3/res"
  relu_param {
    negative_slope: 0.1
  }
}

layer {
  name: "mask0"
  type: "Convolution"
  bottom: "mask0/bottle3/res"
  top: "mask0"
  convolution_param {
    num_output: 1
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    pad: 0
    stride: 1
    bias_term: false
    engine: DEFAULT
  }
}
layer {
  name: "mask0/bn"
  type: "BatchNorm"
  bottom: "mask0"
  top: "mask0"
  batch_norm_param {
    moving_average_fraction: 0.1
  }
}
layer {
  name: "mask0/scale"
  type: "Scale"
  bottom: "mask0"
  top: "mask0"
  scale_param {
    bias_term: true
    filler {
      value: 1.0
    }
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "mask0/sigmoid"
  type: "Sigmoid"
  bottom: "mask0"
  top: "mask0/sigmoid"
  sigmoid_param {
    engine: DEFAULT
  }
}
layer {
  name: "mask0/tiled"
  type: "Tile"
  #bottom: "mask0/scaled"
  bottom: "mask0/sigmoid"
  top: "mask0/tiled"
  tile_param {
    axis: 1
    tiles: 256
  }
}
layer {
  name: "mask0/scaled"
  type: "Scale"
  #bottom: "mask0/sigmoid"
  bottom: "mask0/tiled"
  top: "mask0/scaled"
  propagate_down: false
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    bias_term: false
    filler {
      value: 1.0
    }
  }
}

layer {
  name: "masked0"
  type: "Scale"
  bottom: "mask0/scaled"
  bottom: "block4-conv0"
  top: "masked0"
  scale_param {
    axis: 0
  }
}
layer {
  name: "mask0/label"
  type: "BackgroundMask"
  bottom: "mask0"
  bottom: "label"
  propagate_down: false
  propagate_down: false
  top: "mask0/label"
  background_mask_param {
    scale: 1
    sigma_scale: 3
  }
  include {
    phase: TRAIN
  }
}

layer {
  name: "mask0/loss"
  type: "EuclideanLoss"
  bottom: "mask0/sigmoid"
  bottom: "mask0/label"
  propagate_down: true
  propagate_down: false
  top: "mask0/loss"
  loss_weight: 1
  include {
    phase: TRAIN
  }
}
###############################################################################################

layer {
  name: "block4-pool"
  type: "Pooling"
  #bottom: "block4-conv0"
  bottom: "masked0"
  top: "block4-pool"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
    pad: 0
  }
}
layer {
  name: "block5-conv0"
  type: "Convolution"
  bottom: "block4-pool"
  top: "block5-conv0"
  convolution_param {
    num_output: 512
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    pad: 1
    stride: 1
    bias_term: false
    engine: DEFAULT
  }
}
layer {
  bottom: "block5-conv0"
  top: "block5-conv0"
  name: "block5-bn0"
  type: "BatchNorm"
  batch_norm_param {
    moving_average_fraction: 0.1
  }
}
layer {
  bottom: "block5-conv0"
  top: "block5-conv0"
  name: "block5-scale0"
  type: "Scale"
  scale_param {
    bias_term: true
    filler {
      value: 1.0
    }
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  bottom: "block5-conv0"
  top: "block5-conv0"
  name: "block5-relu0"
  type: "ReLU"
  relu_param {
    negative_slope: 0.1
  }
}
layer {
  name: "block5-pool"
  type: "Pooling"
  bottom: "block5-conv0"
  top: "block5-pool"
  pooling_param {
    kernel_size: 1
    stride: 1
    pool: MAX
    pad: 0
    engine: DEFAULT
  }
}
layer {
  name: "block6-conv0"
  type: "Convolution"
  bottom: "block5-pool"
  top: "block6-conv0"
  convolution_param {
    num_output: 1024
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    pad: 1
    stride: 1
    bias_term: false
    engine: DEFAULT
  }
}
layer {
  name: "block6-bn0"
  type: "BatchNorm"
  bottom: "block6-conv0"
  top: "block6-conv0"
  batch_norm_param {
    moving_average_fraction: 0.1
  }
}
layer {
  name: "block6-scale0"
  type: "Scale"
  bottom: "block6-conv0"
  top: "block6-conv0"
  scale_param {
    bias_term: true
    filler {
      value: 1.0
    }
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "block6-relu0"
  type: "ReLU"
  bottom: "block6-conv0"
  top: "block6-conv0"
  relu_param {
    negative_slope: 0.1
  }
}
layer {
  name: "block6-conv1"
  type: "Convolution"
  bottom: "block6-conv0"
  top: "block6-conv1"
  convolution_param {
    num_output: 256
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    pad: 0
    stride: 1
    bias_term: false
    engine: DEFAULT
  }
}
layer {
  name: "block6-bn1"
  type: "BatchNorm"
  bottom: "block6-conv1"
  top: "block6-conv1"
  batch_norm_param {
    moving_average_fraction: 0.1
  }
}
layer {
  name: "block6-scale1"
  type: "Scale"
  bottom: "block6-conv1"
  top: "block6-conv1"
  scale_param {
    bias_term: true
    filler {
      value: 1.0
    }
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "block6-relu1"
  type: "ReLU"
  bottom: "block6-conv1"
  top: "block6-conv1"
  relu_param {
    negative_slope: 0.1
  }
}
layer {
  name: "block6-conv2"
  type: "Convolution"
  bottom: "block6-conv1"
  top: "block6-conv2"
  convolution_param {
    num_output: 512
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    pad: 1
    stride: 1
    bias_term: false
    engine: DEFAULT
  }
}
layer {
  name: "block6-bn2"
  type: "BatchNorm"
  bottom: "block6-conv2"
  top: "block6-conv2"
  batch_norm_param {
    moving_average_fraction: 0.1
  }
}
layer {
  name: "block6-scale2"
  type: "Scale"
  bottom: "block6-conv2"
  top: "block6-conv2"
  scale_param {
    bias_term: true
    filler {
      value: 1.0
    }
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "block6-relu2"
  type: "ReLU"
  bottom: "block6-conv2"
  top: "block6-conv2"
  relu_param {
    negative_slope: 0.1
  }
}

layer {
  name: "yolo-out-l"
  type: "Convolution"
  bottom: "block6-conv2"
  top: "yolo-out-l"
  convolution_param {
    num_output: 75
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    pad: 0
    stride: 1
    bias_term: true
    engine: DEFAULT
  }
}
layer {
  name: "upsampler_conv"
  type: "Convolution"
  bottom: "block6-conv1"
  top: "upsampler"
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    pad: 0
    stride: 1
    bias_term: false
    engine: DEFAULT
  }
}
layer {
  name: "upsampler_bn"
  type: "BatchNorm"
  bottom: "upsampler"
  top: "upsampler"
  batch_norm_param {
    moving_average_fraction: 0.1
  }
}
layer {
  name: "upsampler-scale"
  type: "Scale"
  bottom: "upsampler"
  top: "upsampler"
  scale_param {
    bias_term: true
    filler {
      value: 1.0
    }
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "upsampler-relu"
  type: "ReLU"
  bottom: "upsampler"
  top: "upsampler"
  relu_param {
    negative_slope: 0.1
  }
}
layer {
  name: "upsampler-up"
  type: "Upsample"
  bottom: "upsampler"
  top: "upsampler_up"
  upsample_param: {
    scale: 2
  }
}
layer {
  name: "concat_upsampler"
  type: "Concat"
  bottom: "upsampler_up"
  bottom: "masked0"
  top: "concat_upsampler"
}
layer {
  name: "block7-conv0"
  type: "Convolution"
  bottom: "concat_upsampler"
  top: "block7-conv0"
  convolution_param {
    num_output: 256
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    pad: 1
    stride: 1
    bias_term: false
    engine: DEFAULT
  }
}
layer {
  bottom: "block7-conv0"
  top: "block7-conv0"
  name: "block7-bn0"
  type: "BatchNorm"
  batch_norm_param {
    moving_average_fraction: 0.1
  }
}
layer {
  bottom: "block7-conv0"
  top: "block7-conv0"
  name: "block7-scale0"
  type: "Scale"
  scale_param {
    bias_term: true
    filler {
      value: 1.0
    }
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "block7-relu0"
  type: "ReLU"
  bottom: "block7-conv0"
  top: "block7-conv0"
  relu_param {
    negative_slope: 0.1
  }
}

layer {
  name: "yolo-out-m"
  type: "Convolution"
  bottom: "block7-conv0"
  top: "yolo-out-m"
  convolution_param {
    num_output: 75
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    pad: 0
    stride: 1
    bias_term: true
    engine: DEFAULT
  }
}

layer {
  name: "loss-m"
  type: "Yolov3"
  bottom: "yolo-out-m"
  bottom: "label"
  top: "loss-m"
  loss_weight: 1
  include {
    phase: TRAIN
  }
  yolov3_param {
    display: 800
    side: 26
    num_class: 20
    num: 3
    object_scale: 5.0
    noobject_scale: 1.0
    class_scale: 1.0
    coord_scale: 1.0
    thresh: 0.5
    anchors_scale : 16
    use_logic_gradient : false
    iou_loss: MSE
    label_smooth_eps: 0.0
    use_extra_matched_anchor: true
    biases: 23
    biases: 29
    biases: 48
    biases: 65
    biases: 68
    biases: 144
    biases: 126
    biases: 203
    biases: 204
    biases: 265
    biases: 326
    biases: 188
    mask:0
    mask:1
    mask:2
  }
}

layer {
  name: "loss-l"
  type: "Yolov3"
  bottom: "yolo-out-l"
  bottom: "label"
  top: "loss-l"
  loss_weight: 1
  include {
    phase: TRAIN
  }
  yolov3_param {
    display: 800
    side: 13
    num_class: 20
    num: 3
    object_scale: 5.0
    noobject_scale: 1.0
    class_scale: 1.0
    coord_scale: 1.0
    thresh: 0.5
    anchors_scale : 32
    use_logic_gradient : false
    iou_loss: MSE
    label_smooth_eps: 0.0
    use_extra_matched_anchor: true
    biases: 23
    biases: 29
    biases: 48
    biases: 65
    biases: 68
    biases: 144
    biases: 126
    biases: 203
    biases: 204
    biases: 265
    biases: 326
    biases: 188
    mask:3
    mask:4
    mask:5
  }
}

layer {
  name: "yolo_detection"
  type: "Yolov3DetectionOutput"
  bottom: "yolo-out-m"
  bottom: "yolo-out-l"
  top: "yolo_detection"
  include {
    phase: TEST
  }
  yolov3_detection_output_param {
    nms_threshold: 0.45
    num_classes: 20
    confidence_threshold: 0.01
    biases: 23
    biases: 29
    biases: 48
    biases: 65
    biases: 68
    biases: 144
    biases: 126
    biases: 203
    biases: 204
    biases: 265
    biases: 326
    biases: 188
    mask: 0
    mask: 1
    mask: 2
    mask: 3
    mask: 4
    mask: 5
    mask_group_num: 2
    anchors_scale: 16
    anchors_scale: 32
  }
}
layer {
  name: "yolo_eval"
  type: "DetectionEvaluate"
  bottom: "yolo_detection"
  bottom: "label"
  top: "detection_eval"
  include {
    phase: TEST
  }
  detection_evaluate_param {
    num_classes: 21
    background_label_id: 0
    overlap_threshold: 0.5
    evaluate_difficult_gt: false
  }
}
