name: "TinyVOC"
layer {
  name: "data"
  type: "AnnotatedData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.0039215
    mirror: true
    mean_value: 0
    mean_value: 0
    mean_value: 0
	force_color: true
 	resize_param {
      prob: 0.1
      resize_mode: WARP
      height: 608
      width: 608
      interp_mode: LINEAR
      interp_mode: AREA
      interp_mode: LANCZOS4
    }
    resize_param {
      prob: 0.1
      resize_mode: WARP
      height: 416
      width: 416
      interp_mode: LINEAR
      interp_mode: AREA
      interp_mode: LANCZOS4
    }
	resize_param {
      prob: 0.1
      resize_mode: WARP
      height: 320
      width: 320
      interp_mode: LINEAR
      interp_mode: AREA
      interp_mode: LANCZOS4
    }
	resize_param {
      prob: 0.1
      resize_mode: WARP
      height: 352
      width: 352
      interp_mode: LINEAR
      interp_mode: AREA
      interp_mode: LANCZOS4
    }
	resize_param {
      prob: 0.1
      resize_mode: WARP
      height: 384
      width: 384
      interp_mode: LINEAR
      interp_mode: AREA
      interp_mode: LANCZOS4
    }
	resize_param {
      prob: 0.1
      resize_mode: WARP
      height: 448
      width: 448
      interp_mode: LINEAR
      interp_mode: AREA
      interp_mode: LANCZOS4
    }
	resize_param {
      prob: 0.1
      resize_mode: WARP
      height: 480
      width: 480
      interp_mode: LINEAR
      interp_mode: AREA
      interp_mode: LANCZOS4
    }
	resize_param {
      prob: 0.1
      resize_mode: WARP
      height: 512
      width: 512
      interp_mode: LINEAR
      interp_mode: AREA
      interp_mode: LANCZOS4
    }
	resize_param {
      prob: 0.1
      resize_mode: WARP
      height: 544
      width: 544
      interp_mode: LINEAR
      interp_mode: AREA
      interp_mode: LANCZOS4
    }
	resize_param {
      prob: 0.1
      resize_mode: WARP
      height: 576
      width: 576
      interp_mode: LINEAR
      interp_mode: AREA
      interp_mode: LANCZOS4
    }
    emit_constraint {
      emit_type: CENTER
    }
    distort_param {
      brightness_prob: 0.5
      brightness_delta: 32.0
      contrast_prob: 0.5
      contrast_lower: 0.5
      contrast_upper: 1.5
      hue_prob: 0.5
      hue_delta: 18.0
      saturation_prob: 0.5
      saturation_lower: 0.5
      saturation_upper: 1.5
      random_order_prob: 0.0
    }
  }
  data_param {
    source: "data/VOC0712/VOC0712_trainval_lmdb"
    batch_size: 4
    backend: LMDB
    prefetch: 8
  }
  annotated_data_param {
	yolo_data_type : 1
	yolo_data_jitter : 0.3
    label_map_file:  "data/VOC0712/labelmap_voc.prototxt"
  }
}
layer {
  name: "data"
  type: "AnnotatedData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.0039215
    mean_value: 0
    mean_value: 0
    mean_value: 0
	force_color: true
    resize_param {
      prob: 1.0
      resize_mode: WARP
      #resize_mode: WARP
      height: 416
      width: 416
      interp_mode: LINEAR
    }
  }
  data_param {
    source: "data/VOC0712/VOC0712_test_lmdb"
    batch_size: 2
    backend: LMDB
  }
  annotated_data_param {
    batch_sampler {}
    label_map_file:  "data/VOC0712/labelmap_voc.prototxt"
  }
}

layer {
    name: "block0-conv0"
    type: "Convolution"
    bottom: "data"
    top: "block0-conv0"
    convolution_param {
        num_output: 16
        kernel_size: 3
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
        }
        pad: 1
        stride: 1
        bias_term: false
    }
}
layer {
    name: "block0-bn0"
    type: "BatchNorm"
    bottom: "block0-conv0"
    top: "block0-conv0"
    batch_norm_param {
        eps: 0.0001
    }
}
layer {
    name: "block0-scale0"
    type: "Scale"
    bottom: "block0-conv0"
    top: "block0-conv0"
    scale_param {
        bias_term: true
        filler {
            value: 1.0
        }
        bias_filler {
            value: 0.0
        }
    }
}
layer {
    name: "block0-relu0"
    type: "ReLU"
    bottom: "block0-conv0"
    top: "block0-conv0"
    relu_param {
        negative_slope: 0.1
    }
}
layer {
    name: "block0-pool"
    type: "Pooling"
    bottom: "block0-conv0"
    top: "block0-pool"
    pooling_param {
        kernel_size: 2
        stride: 2
        pool: MAX
        pad: 0
    }
}
layer {
    name: "block1-conv0"
    type: "Convolution"
    bottom: "block0-pool"
    top: "block1-conv0"
    convolution_param {
        num_output: 32
        kernel_size: 3
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
        }
        pad: 1
        stride: 1
        bias_term: false
    }
}
layer {
    name: "block1-bn0"
    type: "BatchNorm"
    bottom: "block1-conv0"
    top: "block1-conv0"
    batch_norm_param {
        eps: 0.0001
    }
}
layer {
    name: "block1-scale0"
    type: "Scale"
    bottom: "block1-conv0"
    top: "block1-conv0"
    scale_param {
        bias_term: true
        filler {
            value: 1.0
        }
        bias_filler {
            value: 0.0
        }
    }
}
layer {
    name: "block1-relu0"
    type: "ReLU"
    bottom: "block1-conv0"
    top: "block1-conv0"
    relu_param {
        negative_slope: 0.1
    }
}
layer {
    name: "block1-pool"
    type: "Pooling"
    bottom: "block1-conv0"
    top: "block1-pool"
    pooling_param {
        kernel_size: 2
        stride: 2
        pool: MAX
        pad: 0
    }
}
layer {
    name: "block2-conv0"
    type: "Convolution"
    bottom: "block1-pool"
    top: "block2-conv0"
    convolution_param {
        num_output: 64
        kernel_size: 3
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
        }
        pad: 1
        stride: 1
        bias_term: false
    }
}
layer {
    name: "block2-bn0"
    type: "BatchNorm"
    bottom: "block2-conv0"
    top: "block2-conv0"
    batch_norm_param {
        eps: 0.0001
    }
}
layer {
    name: "block2-scale0"
    type: "Scale"
    bottom: "block2-conv0"
    top: "block2-conv0"
    scale_param {
        bias_term: true
        filler {
            value: 1.0
        }
        bias_filler {
            value: 0.0
        }
    }
}
layer {
    name: "block2-relu0"
    type: "ReLU"
    bottom: "block2-conv0"
    top: "block2-conv0"
    relu_param {
        negative_slope: 0.1
    }
}
layer {
    name: "block2-pool"
    type: "Pooling"
    bottom: "block2-conv0"
    top: "block2-pool"
    pooling_param {
        kernel_size: 2
        stride: 2
        pool: MAX
        pad: 0
    }
}
layer {
    name: "block3-conv0"
    type: "Convolution"
    bottom: "block2-pool"
    top: "block3-conv0"
    convolution_param {
        num_output: 128
        kernel_size: 3
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
        }
        pad: 1
        stride: 1
        bias_term: false
    }
}
layer {
    name: "block3-bn0"
    type: "BatchNorm"
    bottom: "block3-conv0"
    top: "block3-conv0"
    batch_norm_param {
        eps: 0.0001
    }
}
layer {
    name: "block3-scale0"
    type: "Scale"
    bottom: "block3-conv0"
    top: "block3-conv0"
    scale_param {
        bias_term: true
        filler {
            value: 1.0
        }
        bias_filler {
            value: 0.0
        }
    }
}
layer {
    name: "block3-relu0"
    type: "ReLU"
    bottom: "block3-conv0"
    top: "block3-conv0"
    relu_param {
        negative_slope: 0.1
    }
}
layer {
    name: "block3-pool"
    type: "Pooling"
    bottom: "block3-conv0"
    top: "block3-pool"
    pooling_param {
        kernel_size: 2
        stride: 2
        pool: MAX
        pad: 0
    }
}
layer {
    name: "block4-conv0"
    type: "Convolution"
    bottom: "block3-pool"
    top: "block4-conv0"
    convolution_param {
        num_output: 256
        kernel_size: 3
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
        }
        pad: 1
        stride: 1
        bias_term: false
    }
}
layer {
    name: "block4-bn0"
    type: "BatchNorm"
    bottom: "block4-conv0"
    top: "block4-conv0"
    batch_norm_param {
        eps: 0.0001
    }
}
layer {
    name: "block4-scale0"
    type: "Scale"
    bottom: "block4-conv0"
    top: "block4-conv0"
    scale_param {
        bias_term: true
        filler {
            value: 1.0
        }
        bias_filler {
            value: 0.0
        }
    }
}
layer {
    name: "block4-relu0"
    type: "ReLU"
    bottom: "block4-conv0"
    top: "block4-conv0"
    relu_param {
        negative_slope: 0.1
    }
}
layer {
    name: "block4-pool"
    type: "Pooling"
    bottom: "block4-conv0"
    top: "block4-pool"
    pooling_param {
        kernel_size: 2
        stride: 2
        pool: MAX
        pad: 0
    }
}
layer {
    name: "block5-conv0"
    type: "Convolution"
    bottom: "block4-pool"
    top: "block5-conv0"
    convolution_param {
        num_output: 512
        kernel_size: 3
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
        }
        pad: 1
        stride: 1
        bias_term: false
    }
}
layer {
    bottom: "block5-conv0"
    top: "block5-conv0"
    name: "block5-bn0"
    type: "BatchNorm"
    batch_norm_param {
        eps: 0.0001
    }
}
layer {
    bottom: "block5-conv0"
    top: "block5-conv0"
    name: "block5-scale0"
    type: "Scale"
    scale_param {
        bias_term: true
        filler {
            value: 1.0
        }
        bias_filler {
            value: 0.0
        }
    }
}
layer {
    bottom: "block5-conv0"
    top: "block5-conv0"
    name: "block5-relu0"
    type: "ReLU"
    relu_param {
        negative_slope: 0.1
    }
}
layer {
    name: "block5-pool"
    type: "Pooling"
    bottom: "block5-conv0"
    top: "block5-pool"
    pooling_param {
        kernel_size: 1
        stride: 1
        pool: MAX
        pad: 0
    }
}
layer {
    name: "block6-conv0"
    type: "Convolution"
    bottom: "block5-pool"
    top: "block6-conv0"
    convolution_param {
        num_output: 1024
        kernel_size: 3
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
        }
        pad: 1
        stride: 1
        bias_term: false
    }
}
layer {
    name: "block6-bn0"
    type: "BatchNorm"
    bottom: "block6-conv0"
    top: "block6-conv0"
    batch_norm_param {
        eps: 0.0001
    }
}
layer {
    name: "block6-scale0"
    type: "Scale"
    bottom: "block6-conv0"
    top: "block6-conv0"
    scale_param {
        bias_term: true
        filler {
            value: 1.0
        }
        bias_filler {
            value: 0.0
        }
    }
}
layer {
    name: "block6-relu0"
    type: "ReLU"
    bottom: "block6-conv0"
    top: "block6-conv0"
    relu_param {
        negative_slope: 0.1
    }
}
layer {
    name: "block6-conv1"
    type: "Convolution"
    bottom: "block6-conv0"
    top: "block6-conv1"
    convolution_param {
        num_output: 256
        kernel_size: 1
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
        }
        pad: 0
        stride: 1
        bias_term: false
    }
}
layer {
    name: "block6-bn1"
    type: "BatchNorm"
    bottom: "block6-conv1"
    top: "block6-conv1"
    batch_norm_param {
        eps: 0.0001
    }
}
layer {
    name: "block6-scale1"
    type: "Scale"
    bottom: "block6-conv1"
    top: "block6-conv1"
    scale_param {
        bias_term: true
        filler {
            value: 1.0
        }
        bias_filler {
            value: 0.0
        }
    }
}
layer {
    name: "block6-relu1"
    type: "ReLU"
    bottom: "block6-conv1"
    top: "block6-conv1"
    relu_param {
        negative_slope: 0.1
    }
}
layer {
    name: "block6-conv2"
    type: "Convolution"
    bottom: "block6-conv1"
    top: "block6-conv2"
    convolution_param {
        num_output: 512
        kernel_size: 3
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
        }
        pad: 1
        stride: 1
        bias_term: false
    }
}
layer {
    name: "block6-bn2"
    type: "BatchNorm"
    bottom: "block6-conv2"
    top: "block6-conv2"
    batch_norm_param {
        eps: 0.0001
    }
}
layer {
    name: "block6-scale2"
    type: "Scale"
    bottom: "block6-conv2"
    top: "block6-conv2"
    scale_param {
        bias_term: true
        filler {
            value: 1.0
        }
        bias_filler {
            value: 0.0
        }
    }
}
layer {
    name: "block6-relu2"
    type: "ReLU"
    bottom: "block6-conv2"
    top: "block6-conv2"
    relu_param {
        negative_slope: 0.1
    }
}
layer {
    name: "yolo-out-m"
    type: "Convolution"
    bottom: "block6-conv2"
    top: "yolo-out-m"
    convolution_param {
        num_output: 75
        kernel_size: 1
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
        }
        pad: 0
        stride: 1
        bias_term: true
    }
}
layer {
    name: "upsampler_conv"
    type: "Convolution"
    bottom: "block6-conv1"
    top: "upsampler"
    convolution_param {
        num_output: 128
        kernel_size: 1
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
        }
        pad: 0
        stride: 1
        bias_term: false
    }
}
layer {
    name: "upsampler_bn"
    type: "BatchNorm"
    bottom: "upsampler"
    top: "upsampler"
    batch_norm_param {
        eps: 0.0001
    }
}
layer {
    name: "upsampler-scale"
    type: "Scale"
    bottom: "upsampler"
    top: "upsampler"
    scale_param {
        bias_term: true
        filler {
            value: 1.0
        }
        bias_filler {
            value: 0.0
        }
    }
}
layer {
    name: "upsampler-relu"
    type: "ReLU"
    bottom: "upsampler"
    top: "upsampler"
    relu_param {
        negative_slope: 0.1
    }
}
layer {
    name: "upsampler-up"
    type: "Upsample"
    bottom: "upsampler"
    top: "upsampler_up"
    upsample_param: {
        scale: 2
    }
}
layer {
    name: "concat_upsampler"
    type: "Concat"
    bottom: "upsampler_up"
    bottom: "block4-conv0"
    top: "concat_upsampler"
}
layer {
    name: "block7-conv0"
    type: "Convolution"
    bottom: "concat_upsampler"
    top: "block7-conv0"
    convolution_param {
        num_output: 256
        kernel_size: 3
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
        }
        pad: 1
        stride: 1
        bias_term: false
    }
}
layer {
    bottom: "block7-conv0"
    top: "block7-conv0"
    name: "block7-bn0"
    type: "BatchNorm"
    batch_norm_param {
        eps: 0.0001
    }
}
layer {
    bottom: "block7-conv0"
    top: "block7-conv0"
    name: "block7-scale0"
    type: "Scale"
    scale_param {
        bias_term: true
        filler {
            value: 1.0
        }
        bias_filler {
            value: 0.0
        }
    }
}
layer {
    name: "block7-relu0"
    type: "ReLU"
    bottom: "block7-conv0"
    top: "block7-conv0"
    relu_param {
        negative_slope: 0.1
    }
}
layer {
    name: "yolo-out-s"
    type: "Convolution"
    bottom: "block7-conv0"
    top: "yolo-out-s"
    convolution_param {
        num_output: 75
        kernel_size: 1
        weight_filler {
            type: "xavier"
        }
        bias_filler {
            type: "constant"
        }
        pad: 0
        stride: 1
        bias_term: true
    }
}

layer {
  name: "loss-s"
  type: "Yolov3"
  bottom: "yolo-out-s"
  bottom: "label"
  top: "loss-s"
  loss_weight: 1
  include {
      phase: TRAIN
  }
  yolov3_param {
    side: 13
    num_class: 20
    num: 3
    object_scale: 5.0
    noobject_scale: 1.0
    class_scale: 1.0
    coord_scale: 1.0
    thresh: 0.5
	anchors_scale : 16
    biases: 10
    biases: 14
    biases: 23
    biases: 27
    biases: 37
    biases: 58
    biases: 81
    biases: 82
    biases: 135
    biases: 169
    biases: 344
    biases: 319
	mask:0
	mask:1
	mask:2
  }
}

layer {
  name: "loss-m"
  type: "Yolov3"
  bottom: "yolo-out-m"
  bottom: "label"
  top: "loss-m"
  loss_weight: 1
  include {
      phase: TRAIN
  }
  yolov3_param {
    side: 26
    num_class: 20
    num: 3
    object_scale: 5.0
    noobject_scale: 1.0
    class_scale: 1.0
    coord_scale: 1.0
    thresh: 0.5
	anchors_scale : 32
    biases: 10
    biases: 14
    biases: 23
    biases: 27
    biases: 37
    biases: 58
    biases: 81
    biases: 82
    biases: 135
    biases: 169
    biases: 344
    biases: 319
	mask:3
	mask:4
	mask:5
  }
}

layer {
    name: "yolo_detection"
    type: "Yolov3DetectionOutput"
    bottom: "yolo-out-s"
    bottom: "yolo-out-m"
    top: "yolo_detection"
    include {
        phase: TEST
    }
    yolov3_detection_output_param {
        nms_threshold: 0.45
        num_classes: 20
        confidence_threshold: 0.01
        biases: 10
        biases: 14
        biases: 23
        biases: 27
        biases: 37
        biases: 58
        biases: 81
        biases: 82
        biases: 135
        biases: 169
        biases: 344
        biases: 319
        mask: 0
        mask: 1
        mask: 2
        mask: 3
        mask: 4
        mask: 5
        mask_group_num: 2
        anchors_scale: 16
        anchors_scale: 32
    }
}
layer {
  name: "yolo_eval"
  type: "DetectionEvaluate"
  bottom: "yolo_detection"
  bottom: "label"
  top: "detection_eval"
  include {
    phase: TEST
  }
  detection_evaluate_param {
    num_classes: 21
    background_label_id: 0
    overlap_threshold: 0.3
    evaluate_difficult_gt: false
  }
}
